# 1) გააკეთეთ 5 მაგალითი თითო შედარების ოპერატორზე (>, <, >=, <=, ==, !=.)

first = 50
second = 100
print(second > first) # True იმიტომ რომ 100 მეტია 50-ზე
print(first < second) # True რადგად 50 ნაკლებია 100-ზე
print(second < first) # False რადგან 100 არ არის ნაკლები 50-ზე
print(second >= first) # True რადგან 100 მეტია 50-ზე 
print(first >= second) # False რადგან 50 არ არის მეტი 100 ზე

# 2) საკლასო დავალება: True, False ბულეანებზე ჩამოწერეთ 4 კომბინაცია.

# ეს გააკეთეთ ან ოპერატორზეც და და ოპერატორზეც.

# თითეოული კომბინაციის შედეგი უნდა დაიბეჭდოს და მარჯვნივ მიუწერეთ კომენტარის სახით შედეგი რაც არის

first1 = 50
second2 = 100
print(first1 or second2) # 50. გამოიტანს პირველ შემხვედრს ანუ first1 = 50, შედეგი იქნება 50
print(second2 and first1) # 50. აქაც იგივე მოხდება რაც პირველში
print(first1 >= second2) # False რადგან 50 არ არის ტოლი 100 ის და არც მეტი 100 ის
print(second2 <= first1) # False რადგან 100 არ არის არც ნაკლები და არც ტოლი 50 ის